neon-smart-studio/W-Link_NeonRTOS_STM32/src/W-Link/Driver/DAC/DAC_Pin.h

#ifndef DAC_PIN_H
#define DAC_PIN_H

#ifdef STM32F0
#include "Pin/DAC_Pin_STM32F0.h"
#endif //STM32F0

#ifdef STM32F1
#include "Pin/DAC_Pin_STM32F1.h"
#endif //STM32F1

#ifdef STM32F2
#include "Pin/DAC_Pin_STM32F2.h"
#endif //STM32F2

#ifdef STM32F3
#include "Pin/DAC_Pin_STM32F3.h"
#endif //STM32F3

#ifdef STM32F4
#include "Pin/DAC_Pin_STM32F4.h"
#endif //STM32F4

#ifdef STM32F7
#include "Pin/DAC_Pin_STM32F7.h"
#endif //STM32F7

#ifdef STM32G0
#include "Pin/DAC_Pin_STM32G0.h"
#endif //STM32G0

#ifdef STM32G4
#include "Pin/DAC_Pin_STM32G4.h"
#endif //STM32G4

#ifdef STM32H5
#include "Pin/DAC_Pin_STM32H5.h"
#endif //STM32H5

#ifdef STM32H7
#include "Pin/DAC_Pin_STM32H7.h"
#endif //STM32H7

#ifdef STM32H7RS
#include "Pin/DAC_Pin_STM32H7RS.h"
#endif //STM32H7RS

#ifdef STM32L0
#include "Pin/DAC_Pin_STM32L0.h"
#endif //STM32L0

#ifdef STM32L1
#include "Pin/DAC_Pin_STM32L1.h"
#endif //STM32L1

#ifdef STM32L4
#include "Pin/DAC_Pin_STM32L4.h"
#endif //STM32L4

#ifdef STM32L5
#include "Pin/DAC_Pin_STM32L5.h"
#endif //STM32L5

#ifdef STM32U0
#include "Pin/DAC_Pin_STM32U0.h"
#endif //STM32U0

#ifdef STM32U5
#include "Pin/DAC_Pin_STM32U5.h"
#endif //STM32U5

#ifdef STM32H7
#include "Pin/DAC_Pin_STM32H7.h"
#endif //STM32H7

#endif //DAC_PIN_H